12/data/attachments/15473d30ca99dfe8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6d7ff4ba-9992-45e7-a513-fb032074ddca</nif:username>
            <nif:friendToBeAdded>Andrew_reason_Friend_89454_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>